In [1]:
import pandas as pd
import numpy as np
import regex as re

In [2]:
content = pd.read_csv('data/movie_titles3.csv', index_col=False, names = ['id', 'year', 'title'])
content.head()

/var/folders/xc/4fn08svj2dgdk_3wj3xkp_rr0000gn/T/ipykernel_27741/3666075594.py:1: ParserWarning: Length of header or names does not match length of data. This leads to a loss of data with index_col=False.
  content = pd.read_csv('data/movie_titles3.csv', index_col=False, names = ['id', 'year', 'title'])

   id    year                         title
0   1  2003.0               Dinosaur Planet
1   2  2004.0    Isle of Man TT 2004 Review
2   3  1997.0                     Character
3   4  1994.0  Paula Abdul's Get Up & Dance
4   5  2004.0      The Rise and Fall of ECW

In [3]:
#checking that everything imported correctly
content.loc[content['id'] == 394]

      id    year                        title
393  394  1916.0  20000 Leagues Under the Sea

# Dataset1

In [33]:
# Reading dataset file
dataset1 = pd.read_csv('data/combined_data_1.txt',header = None, names = ['cust_id', 'rating', 'date'])
dataset1.head()

   cust_id  rating        date
0       1:     NaN         NaN
1  1488844     3.0  2005-09-06
2   822109     5.0  2005-05-13
3   885013     4.0  2005-10-19
4    30878     4.0  2005-12-26

In [5]:
# looking for movie ids
# count all nan values in rating column
d_nan = dataset1[(dataset1['rating'].isna())]
d_nan

         cust_id  rating date
0             1:     NaN  NaN
548           2:     NaN  NaN
694           3:     NaN  NaN
2707          4:     NaN  NaN
2850          5:     NaN  NaN
...          ...     ...  ...
24046714   4495:     NaN  NaN
24047329   4496:     NaN  NaN
24056849   4497:     NaN  NaN
24057564   4498:     NaN  NaN
24057834   4499:     NaN  NaN

[4499 rows x 3 columns]

In [34]:
mid_tf = pd.DataFrame(dataset1['rating'].isnull())
mid_tf = mid_tf.reset_index()
mid_tf.head()

   index  rating
0      0    True
1      1   False
2      2   False
3      3   False
4      4   False

In [ ]:
#only storing index with movie id
#mid_tf = mid_tf[mid_tf['rating'] == True]
#mid_tf.head()

In [35]:
#only movie values
mid_index = pd.DataFrame(dataset1[(dataset1['rating'].isnull())])
mid_index.head()

     cust_id  rating date
0         1:     NaN  NaN
548       2:     NaN  NaN
694       3:     NaN  NaN
2707      4:     NaN  NaN
2850      5:     NaN  NaN

In [36]:
#rename movie index
mid_index = mid_index.rename(columns = {'cust_id': 'movie_id'})
mid_index.head()

     movie_id  rating date
0          1:     NaN  NaN
548        2:     NaN  NaN
694        3:     NaN  NaN
2707       4:     NaN  NaN
2850       5:     NaN  NaN

In [ ]:
#mid_index = mid_index.drop(['rating', 'date'], axis =1)
#mid_index.head()

In [ ]:
#mid_tf.info()

In [ ]:
#mid_index = pd.concat([mid_index, mid_tf], join = 'outer')
#mid_index.head()

In [ ]:
#mid_index.info()

In [27]:
#mid_index.reset_index(inplace=True)

In [37]:
mid_index.head()

     movie_id  rating date
0          1:     NaN  NaN
548        2:     NaN  NaN
694        3:     NaN  NaN
2707       4:     NaN  NaN
2850       5:     NaN  NaN

In [40]:
#drop movieid punctuation
def drop_punctuation(df):
    midnew = []
    for index, row in df.iterrows():
        mid1 = str(row['movie_id'])
        regex = r"[!\"#\$%&\'\(\)\*\+,-\./:;<=>\?@\[\\\]\^_`{\|}~]"
        mid1 = re.sub(regex, '', mid1)
        midnew.append(mid1)
        
    df['mid'] = midnew

    return df

In [41]:
drop_punctuation(mid_index)
mid_index = mid_index[['mid']]
mid_index.head()

     mid
0      1
548    2
694    3
2707   4
2850   5

In [48]:
dataset1.head()

   cust_id  rating        date
0       1:     NaN         NaN
1  1488844     3.0  2005-09-06
2   822109     5.0  2005-05-13
3   885013     4.0  2005-10-19
4    30878     4.0  2005-12-26

In [ ]:
#d1 = d1.rename(columns = {'index': 'i1'})
#d1.head()

In [63]:
d1 = pd.concat([dataset1, mid_index], axis = 1 )

In [64]:
d1.head()

   cust_id  rating        date  mid
0       1:     NaN         NaN    1
1  1488844     3.0  2005-09-06  NaN
2   822109     5.0  2005-05-13  NaN
3   885013     4.0  2005-10-19  NaN
4    30878     4.0  2005-12-26  NaN

In [65]:
d1.iloc[2850]

cust_id     5:
rating     NaN
date       NaN
mid          5
Name: 2850, dtype: object

In [66]:
d1 = d1.reindex(['mid', 'cust_id', 'rating', 'date'], axis= 1)
d1.head()

   mid  cust_id  rating        date
0    1       1:     NaN         NaN
1  NaN  1488844     3.0  2005-09-06
2  NaN   822109     5.0  2005-05-13
3  NaN   885013     4.0  2005-10-19
4  NaN    30878     4.0  2005-12-26